# Adding Rows

In [1]:
import pandas as pd

In [3]:
data={
    "Name":["Ali", "Mehmood", "Akram", "Daniyal", "Habib", "Zohran", "Ghafoor", "Rehman"],
    "Age":[29, 34, 22, 38, 29, 45, 53, 60],
    "Salary":[50000, 60000, 45000, 52000, 49000, 70000, 48000, 58000],
    "Performance Score":[85, 90, 78, 92, 88, 95, 80, 54]
}

df=pd.DataFrame(data)

In [5]:
df["Bonus"] = df["Salary"]*0.10
print(df)

      Name  Age  Salary  Performance Score   Bonus
0      Ali   29   50000                 85  5000.0
1  Mehmood   34   60000                 90  6000.0
2    Akram   22   45000                 78  4500.0
3  Daniyal   38   52000                 92  5200.0
4    Habib   29   49000                 88  4900.0
5   Zohran   45   70000                 95  7000.0
6  Ghafoor   53   48000                 80  4800.0
7   Rehman   60   58000                 54  5800.0

insert() is a method used to add a new column at a specific position inside a DataFrame.

In [6]:
df.insert(0, "Employee ID", [1,2,3,4,5,6,7,8])
print(df)

   Employee ID     Name  Age  Salary  Performance Score   Bonus
0            1      Ali   29   50000                 85  5000.0
1            2  Mehmood   34   60000                 90  6000.0
2            3    Akram   22   45000                 78  4500.0
3            4  Daniyal   38   52000                 92  5200.0
4            5    Habib   29   49000                 88  4900.0
5            6   Zohran   45   70000                 95  7000.0
6            7  Ghafoor   53   48000                 80  4800.0
7            8   Rehman   60   58000                 54  5800.0

### Updating Values in DataFrame

.loc in Pandas is used to select rows and columns by labels (names), not by position.

In [ ]:
df.loc[0, "Salary"] = 55000
print(df)

In [19]:
#increasing salary in same col

df['Salary'] = df['Salary'] * 1.1
print(df)

   Employee ID     Name  Age   Salary  Performance Score   Bonus  Score
0            1      Ali   29  60500.0                 85  5000.0    NaN
1            2  Mehmood   34  66000.0                 90  6000.0    NaN
2            3    Akram   22  49500.0                 78  4500.0    NaN
3            4  Daniyal   93  57200.0                 93  5200.0   93.0
4            5    Habib   29  53900.0                 88  4900.0    NaN
5            6   Zohran   45  77000.0                 95  7000.0    NaN
6            7  Ghafoor   53  52800.0                 80  4800.0    NaN
7            8   Rehman   60  63800.0                 54  5800.0    NaN